dthpto/hd_esp32/main/hd_main.c
// Установка рабочей мощности
void setPower(int16_t pw)
{
	int16_t mp;
	mp = getIntParam(DEFL_PARAMS, "maxPower");
	if (pw > mp) SetPower = mp;
	else SetPower = pw;

	if (pw > mp/2) {
		LEDC.channel_group[0].channel[0].duty.duty = (TRIAC_GATE_IMPULSE_CYCLES*3) << 4;
	} else {
		LEDC.channel_group[0].channel[0].duty.duty = TRIAC_GATE_IMPULSE_CYCLES << 4;
	}

	if (pw>0) setProcessGpio(1);
	else setProcessGpio(0);

	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "SetPower", SetPower);
	}
}                                                   

static void setNewProcChimSR(int16_t newValue)
{
	ProcChimSR = newValue;
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "ProcChimSR", ProcChimSR);
	}

}

static void setTempStabSR(double newValue)
{
	uint64_t v;
	tempStabSR = newValue;
	if (nvsHandle) {
		v = (uint64_t) tempStabSR;
		ESP_ERROR_CHECK(nvs_set_u64(nvsHandle, "tempStabSR", v));
	}
}

static void setTempTube20Prev(double newValue)
{
	uint64_t v;
	tempTube20Prev = newValue;
	if (nvsHandle) {
		v = (uint64_t) tempTube20Prev;
		ESP_ERROR_CHECK(nvs_set_u64(nvsHandle, "tempTube20Prev", v));
	}

}

void setNewMainStatus(int16_t newStatus)
{
	MainStatus = newStatus;
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "MainStatus", MainStatus);
	}
}


// Установка нового режима работы
void setMainMode(int nm)
{
	main_mode new_mode = (main_mode) nm;
	if (new_mode == MainMode) return; // Не изменился
	MainMode = new_mode;
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "MainMode", nm);
	}

	switch (MainMode) {
	case MODE_IDLE:
		// Режим мониторинга
		ESP_LOGI(TAG, "Main mode: Idle.");
		setPower(0);
		setNewMainStatus(START_WAIT);
		break;
	case MODE_POWEERREG:
		// Режим регулятора мощности
		ESP_LOGI(TAG, "Main mode: Power reg.");
		setNewMainStatus(PROC_START);
		//setPower(getIntParam(DEFL_PARAMS, "ustPowerReg"));
		break;
	case MODE_DISTIL:
		// Режим дистилляции
		ESP_LOGI(TAG, "Main mode: Distillation.");
		setNewMainStatus(START_WAIT);
		break;
	case MODE_RECTIFICATION:
		// Режим ректификации
		ESP_LOGI(TAG, "Main mode: Rectification.");
		setNewMainStatus(START_WAIT);
		break;
	case MODE_TESTKLP:
		// Режим тестирования клапанов
		ESP_LOGI(TAG, "Main mode: Test klp.");
		setNewMainStatus(START_WAIT);
		break;
	}
	DBG("4");
	myBeep(false);
}

// Ручная установка состояния конечного автомата
void setStatus(int next)
{
	if (next && MainStatus>=PROC_END) return;
	if (!next && MainStatus<= START_WAIT) return;

	switch (MainMode) {
	case MODE_DISTIL:
		// Режим дистилляции
		if (next) {
			if (MainStatus == START_WAIT) {
				setNewMainStatus(PROC_START);
			} else if (MainStatus == PROC_START) {
				startPressure = bmpTruePressure; // Фиксация атм. давления.
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_RAZGON) {
				openKlp(klp_water);		// Открытие клапана воды
				setPower(getIntParam(DEFL_PARAMS, "powerDistil"));	// Мощность дистилляции
				setNewMainStatus(PROC_DISTILL);
			} else if (MainStatus == PROC_DISTILL) {
				setPower(0);		// Снятие мощности с тэна
				secTempPrev = uptime_counter;
				setNewMainStatus(PROC_WAITEND);
			} else if (MainStatus == PROC_WAITEND) {
				closeAllKlp();		// Закрытие всех клапанов.
				setNewMainStatus(PROC_END);
			}
		} else {
			if (MainStatus == PROC_RAZGON) {
				setPower(0);		// Снятие мощности с тэна
				closeAllKlp();		// Закрытие всех клапанов.
				setNewMainStatus(START_WAIT);
			} else if (MainStatus == PROC_DISTILL) {
				closeAllKlp();		// Закрытие всех клапанов.
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_WAITEND) {
				openKlp(klp_water);		// Открытие клапана воды
				setPower(getIntParam(DEFL_PARAMS, "powerDistil"));	// Мощность дистилляции
				setNewMainStatus(PROC_DISTILL);
			} else if (MainStatus == PROC_END) {
				openKlp(klp_water);		// Открытие клапана воды
				secTempPrev = uptime_counter;
				setNewMainStatus(PROC_WAITEND);
			}
		}
		break;

	case MODE_RECTIFICATION:
		// Режим ректификации
		if (next) {
			if (MainStatus == START_WAIT) {
				setNewMainStatus(PROC_START);
			} else if (MainStatus == PROC_START) {
				startPressure = bmpTruePressure; // Фиксация атм. давления.
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_RAZGON) {
				openKlp(klp_water);	// Открытие клапана воды
				setPower(getIntParam(DEFL_PARAMS, "powerRect"));    // Устанавливаем мощность ректификации
				setNewMainStatus(PROC_STAB); // Ручной переход в режим стабилизации
			} else if (MainStatus == PROC_STAB) {
				setPower(getIntParam(DEFL_PARAMS, "powerRect"));   // Устанавливаем мощность ректификации
				secTempPrev = uptime_counter;
				closeKlp(klp_sr);	// Отключение клапана отбора товарного продукта
				// Устанавливаем медленный ШИМ клапан отбора хвостов и голов в соответвии с установками
				start_valve_PWMpercent(klp_glwhq,
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					getFloatParam(DEFL_PARAMS, "procChimOtbGlv"));

				setTempStabSR(getTube20Temp() ); // температура, относительно которой будем стабилизировать отбор
				setNewMainStatus(PROC_GLV); // Ручной переход в режим отбора голов
			} else if (MainStatus == PROC_GLV) {
				setTempStabSR(getTube20Temp());	// температура, относительно которой будем стабилизировать отбор
				closeKlp(klp_glwhq);  // Отключение клапана отбора голов/хвостов
				setNewProcChimSR( getIntParam(DEFL_PARAMS, "beginProcChimOtbSR") ); // Устанавливаем стартовый % отбора товарного продукта
				setNewMainStatus(PROC_T_WAIT);
			} else if (MainStatus == PROC_T_WAIT) {
				setNewMainStatus(PROC_SR);
			} else if (MainStatus == PROC_SR) {
				closeKlp(klp_sr); // Отключение клапана продукта
				// Устанавливаем 90% медленный ШИМ клапан отбора хвостов и голов
				start_valve_PWMpercent(klp_glwhq,
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
						100);

				setNewMainStatus(PROC_HV);
			} else if (MainStatus == PROC_HV) {
				setPower(0);		// Снятие мощности с тэна
				closeKlp(klp_glwhq); 	// Отключение клапана отбора голов/хвостов
				setNewMainStatus(PROC_WAITEND);
			} else if (MainStatus == PROC_WAITEND) {
				setPower(0);		// Снятие мощности с тэна
				closeAllKlp();		// Закрытие всех клапанов.
				setNewMainStatus(PROC_END);
			}
		} else {
			if (MainStatus == PROC_RAZGON) {
				// Из разгона в режим ожидания запуска
				setPower(0);		// Снятие мощности с тэна
				closeAllKlp();		// Закрытие всех клапанов.
        			setNewMainStatus(START_WAIT);
			} else if (MainStatus == PROC_STAB) {
				// Из стабилизации в режим разгона
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_GLV) {
				setNewMainStatus(PROC_STAB);
			} else if (MainStatus == PROC_T_WAIT) {
				setNewMainStatus(PROC_GLV);
			} else if (MainStatus == PROC_SR) {
				setNewMainStatus(PROC_GLV);
			} else if (MainStatus == PROC_HV) {
				setNewMainStatus(PROC_SR);
			} else if (MainStatus == PROC_WAITEND) {
				// Переходим к отбору хвостов
				setPower(getIntParam(DEFL_PARAMS, "powerRect"));	// Устанавливаем мощность ректификации
				closeKlp(klp_sr);	// Отключение клапана отбора товарного продукта
				// Устанавливаем 90% медленный ШИМ клапан отбора хвостов и голов
				start_valve_PWMpercent(klp_glwhq,
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
						100);

				setNewMainStatus(PROC_HV);
			} else if (MainStatus == PROC_END) {
				openKlp(klp_water);	// Открытие клапана воды
				secTempPrev = uptime_counter;
				setNewMainStatus(PROC_WAITEND);
			}
		}
		break;
	default:
		break;
	}
	if (getIntParam(DEFL_PARAMS, "beepChangeState")) {
		DBG("5");
		myBeep(false);
	}
}

