dthpto/hd_esp32/main/hd_main.c
void valveCMDtask(void *arg){
	valveCMDmessage_t qcmd;
	ledc_channel_t ch;
	TickType_t xLastWakeTime=0, prevValveSwitch=0;

	while (1){
		if (xQueueReceive(valve_cmd_queue, &qcmd, portMAX_DELAY)!=pdTRUE) // ждем события на открытие/закрытие клапана
			continue;																									// если таймаут - повторим
		ch = Klp[qcmd.valve_num].channel;															// ledc-канал  клапана
		LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 1;
		DBG("v:%d(ch:%d) cmd:%d",qcmd.valve_num,ch,qcmd.cmd);
		switch (qcmd.cmd) {
			case cmd_open:
				if (! Klp[qcmd.valve_num].is_open) { // если клапан закрыт то открываем
					// -------логика "тихого" включения
					if (getIntParam(DEFL_PARAMS,"klpSilentNode")) {
						ledc_set_fade_with_time(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY, VALVE_ON_FADE_TIME_MS);
						ledc_fade_start(LEDC_HIGH_SPEED_MODE, ch, LEDC_FADE_NO_WAIT);
						vTaskDelay(VALVE_ON_FADE_TIME_MS/portTICK_PERIOD_MS);
					} else {
						ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY);
						ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					}
					xLastWakeTime = xTaskGetTickCount ();// системное время включения, в тиках
	#ifdef DEBUG
					DBG(" ON:%d(%d ms)",qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS );
					prevValveSwitch=xLastWakeTime;
	#endif
					Klp[qcmd.valve_num].is_open = true;
					// ---------логика снижения ШИМ клапана после его включения---------
					if (((qcmd.valve_num == klp_water)&&(getIntParam(DEFL_PARAMS,"klp1_isPWM"))) //если на воде - насос управляемый PWM то не снижаем
						||
						 (qcmd.valve_num == klp_diff) // если это ключ выхода на дифф-автомат то не снижаем
						) break;

					if ((KEEP_KLP_PWM==0)||(KEEP_KLP_PWM==100)) break;								// если настройка ШИМ удержания 0 или 100 - не снижаем
					if (	(Klp[qcmd.valve_num].is_pwm)																//если клапан в ШИМ
							&&																										//и время открытого его состояния
							(KEEP_KLP_DELAY_MS >= (Klp[qcmd.valve_num].open_time*1000))			//меньше времени задержки до перехода на удержание
						)	{																											// то не снижаем
						break;
					}

					vTaskDelayUntil( &xLastWakeTime, KEEP_KLP_DELAY_MS/portTICK_PERIOD_MS );//ждем включения механики клапана
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, ((VALVE_DUTY*KEEP_KLP_PWM)/100ul));
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
				}
				else {
					DBG("ON ignored");
				}
				break;

			case cmd_close:
				if (Klp[qcmd.valve_num].is_open){ // закрываем если открыт
#ifdef DEBUG
					xLastWakeTime = xTaskGetTickCount ();
					DBG("OFF:%d(%d ms)", qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS);
					prevValveSwitch =xLastWakeTime;
#endif
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, 0);
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 0;
					Klp[qcmd.valve_num].is_open = false;
				}
				else {
					DBG("cmd close ignored");
				}
				break;
			default:
				break;
		}
	}
}

void setTimezone(int gmt_offset){
	char tz[10];
	snprintf(tz, 10, "CST-%d", gmt_offset);
	setenv("TZ", tz, 1);
	tzset();
}
